//
//  ViewController.swift
//  ApplePie
//
//  Created by Гость on 19.01.2019.
//  Copyright © 2019 Гость. All rights reserved.
//

import UIKit

class ViewController: UIViewController {

    @IBOutlet weak var treeImageView: UIImageView!
    @IBOutlet weak var correctWordLabel: UILabel!
    @IBOutlet weak var scoreLabel: UILabel!
    
    var listOfWords = ["Бар",
                       "Гоа",
                       "Ифе",
                       "Кос",
                       "Рим",
                       "Фес",
                       "Хюэ",
                       "Бари",
                       "Берн",
                       "Бонн",
                       "Брно",
                       "Вена",
                       "Гент",
                       "Грац",
                       "Дели",
                       "Доха",
                       "Евле",
                       "Зуль",
                       "Итон",
                       "Йезд",
                       "Йена",
                       "Йорк",
                       "Каир",
                       "Киев",
                       "Кито",
                       "Лидс",
                       "Лима",
                       "Линц",
                       "Лион",
                       "Льеж",
                       "Мале",
                       "Нант",
                       "Нара",
                       "Орша",
                       "Осло",
                       "Оулу",
                       "Перт",
                       "Пиза",
                       "Пула",
                       "Рига",
                       "Себу",
                       "Сеул",
                       "Сиде",
                       "Сува",
                       "Сусс",
                       "Таба",
                       "Ульм",
                       "Фару",
                       "Фриа",
                       "Чуст",
                       "Шиен",
                       "Яссы",
                       "Аахен",
                       "Акаба",
                       "Аккра",
                       "Алжир",
                       "Амман",
                       "Антиб",
                       "Асуан",
                       "Афины",
                       "Ашдод",
                       "БакуЯ",
                       "Белек",
                       "Бордо",
                       "Брест",
                       "Будва",
                       "Варна",
                       "Гаага",
                       "Гагра",
                       "Галле",
                       "Гдыня",
                       "Генуя",
                       "Герат",
                       "Давос",
                       "Дакка",
                       "Далат",
                       "Дахаб",
                       "Дидим",
                       "Дубай",
                       "Жужуй",
                       "Задар",
                       "Зария",
                       "Ибинь",
                       "Ибица",
                       "Измир",
                       "Кабул",
                       "Кадис",
                       "Канны",
                       "Капри",
                       "Кельн",
                       "Кемер",
                       "Корфу",
                       "Котор",
                       "Краби",
                       "Лагос",
                       "Лахти",
                       "Лилль",
                       "Лодзь",
                       "Лхаса",
                       "Львов",
                       "Любек",
                       "Мекка",
                       "Милан",
                       "Минск",
                       "Муйне",
                       "Навои",
                       "Нагоя",
                       "Намюр",
                       "Нарва",
                       "Ницца",
                       "Омаха",
                       "Оруро",
                       "Орхус",
                       "Осака",
                       "Охрид",
                       "Падуя",
                       "Париж",
                       "Патры",
                       "Пафос",
                       "Пекин",
                       "Пореч",
                       "Порту",
                       "Прага",
                       "Пусан",
                       "Рабат",
                       "Равда",
                       "Реймс",
                       "Риека",
                       "Родос",
                       "Салоу",
                       "Санья",
                       "Сегед",
                       "Сиань",
                       "Сиена",
                       "Сиэтл",
                       "Сопот",
                       "София",
                       "Сплит",
                       "Сухум",
                       "Сфакс",
                       "Тиват",
                       "Токио",
                       "Томар",
                       "Тулон",
                       "Тунис",
                       "Турин",
                       "Турку",
                       "Узген",
                       "Ухань",
                       "Фанес",
                       "Хайфа",
                       "Ханой",
                       "Ханья",
                       "Хевиз",
                       "Хэйхэ",
                       "Цюрих",
                       "Чанша",
                       "Чешме",
                       "Чэнду",
                       "Чэндэ",
                       "Шартр",
                       "Щецин",
                       "Эйлат",
                       "Юджин",
                       "Янгон",
                       "Яунде",
                       "Агадир",
                       "Аджмер",
                       "Аланья",
                       "Албена",
                       "Алеппо",
                       "Анкара",
                       "Анкона",
                       "Астана",
                       "Багдад",
                       "Базель",
                       "Балчик",
                       "Банско",
                       "Бейрут",
                       "Берген",
                       "Берлин",
                       "Бишкек",
                       "Бланес",
                       "Богота",
                       "Бодрум",
                       "Бостон",
                       "Брашов",
                       "Бремен",
                       "Брюгге",
                       "Бургас",
                       "Верона",
                       "Гавана",
                       "Глазго",
                       "Далянь",
                       "Дамаск",
                       "Дананг",
                       "Джерба",
                       "Джидда",
                       "Донецк",
                       "Дублин",
                       "Дурбан",
                       "Елгава",
                       "Ереван",
                       "Женева",
                       "Жирона",
                       "Загреб",
                       "Иматра",
                       "Исфара",
                       "Кавала",
                       "Канкун",
                       "Карачи",
                       "Квебек",
                       "Кошице",
                       "Краков",
                       "Куопио",
                       "Кучинг",
                       "Линдос",
                       "Лондон",
                       "Луанда",
                       "Лугано",
                       "Луксор",
                       "Люблин",
                       "Люцерн",
                       "Мадрид",
                       "Майами",
                       "Малага",
                       "Мальме",
                       "Манаус",
                       "Манила",
                       "Маскат",
                       "Махдия",
                       "Медина",
                       "Мерида",
                       "Мехико",
                       "Мешхед",
                       "Мумбаи",
                       "Мурсия",
                       "Мюнхен",
                       "Нагано",
                       "Нагпур",
                       "Намибе",
                       "Нанкин",
                       "Нассау",
                       "Несебр",
                       "Нячанг",
                       "Оахака",
                       "Овьедо",
                       "Оденсе",
                       "Одесса",
                       "Окленд",
                       "Олбани",
                       "Ольгин",
                       "Орлеан",
                       "Оттава",
                       "Панама",
                       "Пенанг",
                       "Попрад",
                       "Порвоо",
                       "Пхукет",
                       "Ресифи",
                       "Римини",
                       "Росток",
                       "Сафага",
                       "Сидней",
                       "Скопье",
                       "Спарта",
                       "Тайбэй",
                       "Таллин",
                       "Тебриз",
                       "Тирана",
                       "Триест",
                       "Тромсе",
                       "Тулуза",
                       "Упсала",
                       "Урумчи",
                       "Утрехт",
                       "Фаэнца",
                       "Фетхие",
                       "Финикс",
                       "Фрибур",
                       "Фуншал",
                       "Фучжоу",
                       "Хайфон",
                       "Хараре",
                       "Харбин",
                       "Харлем",
                       "Циндао",
                       "Ченнаи",
                       "Чикаго",
                       "Чиуауа",
                       "Чунцин",
                       "Шамони",
                       "Шанхай",
                       "Шарджа",
                       "Шверин",
                       "Шеньян",
                       "Юрмала",
                       "Амальфи",
                       "Анталия",
                       "Аринсал",
                       "Атланта",
                       "Ашкелон",
                       "Ашхабад",
                       "Бангкок",
                       "Белград",
                       "Белфаст",
                       "Бильбао",
                       "Болонья",
                       "Боровец",
                       "Брисбен",
                       "Валетта",
                       "Варшава",
                       "Венеция",
                       "Вильнюс",
                       "Вифлеем",
                       "Вроцлав",
                       "Гамбург",
                       "Гданьск",
                       "Гонконг",
                       "Гранада",
                       "Гудаута",
                       "Гулрыпш",
                       "Даламан",
                       "Детройт",
                       "Джайпур",
                       "Дрезден",
                       "Душанбе",
                       "Елените",
                       "Житомир",
                       "Занстад",
                       "Зельден",
                       "Зугдиди",
                       "Инсбрук",
                       "Исфахан",
                       "Итабира",
                       "Калгари",
                       "Калифея",
                       "Кальяри",
                       "Каракас",
                       "Катания",
                       "Керкира",
                       "Кишинев",
                       "Коломбо",
                       "Конаклы",
                       "Кранево",
                       "Ларнака",
                       "Лассити",
                       "Лейпциг",
                       "Ливорно",
                       "Лозанна",
                       "Луганск",
                       "Лутраки",
                       "Любляна",
                       "Майорка",
                       "Манагуа",
                       "Марсель",
                       "Мессина",
                       "Момбаса",
                       "Мюнстер",
                       "Назарет",
                       "Найроби",
                       "Наньнин",
                       "Наньчан",
                       "Неаполь",
                       "Нетания",
                       "Никосия",
                       "Нувейба",
                       "Оксфорд",
                       "Олимпия",
                       "Оломоуц",
                       "Ольборг",
                       "Ольштын",
                       "Острава",
                       "Палермо",
                       "Паттайя",
                       "Пескара",
                       "Пицунда",
                       "Пловдив",
                       "Пльзень",
                       "Познань",
                       "Поморие",
                       "Пхеньян",
                       "Ретимно",
                       "Саппоро",
                       "Сассари",
                       "Севилья",
                       "Серфаус",
                       "Сольдеу",
                       "Стамбул",
                       "Тампере",
                       "Таранто",
                       "Ташкент",
                       "Тбилиси",
                       "Тегеран",
                       "Теплице",
                       "Торонто",
                       "Трабзон",
                       "Удджайн",
                       "Ужгород",
                       "Уральск",
                       "Фергана",
                       "Феррара",
                       "Фигерас",
                       "Фокшани",
                       "Фрипорт",
                       "Фритаун",
                       "Хагатна",
                       "Хамадан",
                       "Ханчжоу",
                       "Харьков",
                       "Хошимин",
                       "Худжанд",
                       "Хургада",
                       "Хьюстон",
                       "Церматт",
                       "Цицикар",
                       "Чанчунь",
                       "Шамбери",
                       "Шеффилд",
                       "Шибеник",
                       "Шигадзе",
                       "Эрзурум",
                       "Яблонец",
                       "Ялиссос",
                       "Аделаида",
                       "Аликанте",
                       "Альмерия",
                       "Анкоридж",
                       "Аугсбург",
                       "Бангалор",
                       "Белосток",
                       "Бенидорм",
                       "Бразилиа",
                       "Бристоль",
                       "Брюссель",
                       "Будапешт",
                       "Бухарест",
                       "Валенсия",
                       "Ванкувер",
                       "Варадеро",
                       "Виннипег",
                       "Висбаден",
                       "Вьентьян",
                       "Ганновер",
                       "Гетеборг",
                       "Гонолулу",
                       "Гренобль",
                       "Гуанчжоу",
                       "Дебрецен",
                       "Денпасар",
                       "Джакарта",
                       "Дортмунд",
                       "Дуйсбург",
                       "Закинтос",
                       "Закопане",
                       "Занзибар",
                       "Зебрюгге",
                       "Зеефельд",
                       "Зренянин",
                       "Ираклион",
                       "Йокогама",
                       "Йокосука",
                       "Канберра",
                       "Кандагар",
                       "Карлсруэ",
                       "Катманду",
                       "Катовице",
                       "Кейптаун",
                       "Колимбия",
                       "Кушадасы",
                       "Лангкави",
                       "Лимассол",
                       "Лиссабон",
                       "Манавгат",
                       "Мармарис",
                       "Мельбурн",
                       "Мишкольц",
                       "Монастир",
                       "Монреаль",
                       "Нагасаки",
                       "Нойштифт",
                       "Нюрнберг",
                       "Олюдениз",
                       "Омдурман",
                       "Очамчира",
                       "Пномпень",
                       "Претория",
                       "Протарас",
                       "Салвадор",
                       "Салоники",
                       "Сантьяго",
                       "Сарагоса",
                       "Сиемреап",
                       "Сиракуза",
                       "Созополь",
                       "Сорренто",
                       "Тенерифе",
                       "Тронхейм",
                       "Фалираки",
                       "Фантхьет",
                       "Флорешты",
                       "Фрайбург",
                       "Фуджейра",
                       "Фукусима",
                       "Фэрбенкс",
                       "Халатики",
                       "Хамамацу",
                       "Хаммамет",
                       "Чарлстон",
                       "Чжэнчжоу",
                       "Чиангмай",
                       "Шарлеруа",
                       "Шеньжень",
                       "Штутгарт",
                       "Эдинбург",
                       "Эдмонтон",
                       "Эльблонг",
                       "Ювяскюля",
                       "Акапулько",
                       "Амстердам",
                       "Антверпен",
                       "Барселона",
                       "Бирмингем",
                       "Вашингтон",
                       "Дубровник",
                       "Зальцбург",
                       "Запорожье",
                       "Иерусалим",
                       "Исламабад",
                       "Йенчепинг",
                       "Калькутта",
                       "Китцбюэль",
                       "Куршавель",
                       "Лансароте",
                       "Ливерпуль",
                       "Маастрихт",
                       "Майрхофен",
                       "Манчестер",
                       "Махмутлар",
                       "Пампорово",
                       "Памуккале",
                       "Пардубице",
                       "Подгорица",
                       "Рейкьявик",
                       "Рованиеми",
                       "Самарканд",
                       "Сарыкамыш",
                       "Ставангер",
                       "Стокгольм",
                       "Страсбург",
                       "Таррагона",
                       "Тяньцзинь",
                       "Фамагуста",
                       "Флоренция",
                       "Фонтенбло",
                       "Форталеза",
                       "Халкидики",
                       "Хельсинки",
                       "Чандигарх",
                       "Читтагонг",
                       "Братислава",
                       "Веллингтон",
                       "Гуантанамо",
                       "Йеллоунайф",
                       "Каппадокия",
                       "Касабланка",
                       "Клагенфурт",
                       "Копенгаген",
                       "Монтевидео",
                       "Пелопоннес",
                       "Регенсбург",
                       "Сиануквиль",
                       "Фейсалабад",
                       "Хайдарабад",
                       "Хяменлинна",
                       "Цинциннати",
                       "Ченстохова",
                       "Александрия",
                       "Дюссельдорф",
                       "Ленгенфельд",
                       "Севастополь",
                       "Филадельфия",
                       "Херсониссос",
                       "Йоханнесбург",
                       "Флорианаполис",
                       "Фуэртевентура",
                       "Днепропетровск",
]
    
    let incorrectMovesAllowed = 7
    
    var totalWins = 0 {
        didSet {
            newRound()
        }
    }
    var totalLosses = 0 {
        didSet {
            show(word: currentGame.word)
            DispatchQueue.main.asyncAfter(deadline: .now() + 2) {
                self.newRound()
            }
        }
    }
    
    var currentGame: Game!
    
    override func viewDidLoad() {
        super.viewDidLoad()
        newRound()
    }

    func enableButtons(in view: UIView, enable: Bool) {
        if let button = view as? UIButton {
            button.isEnabled = enable
        }
        
        for subview in view.subviews {
            enableButtons(in: subview, enable: enable)
        }
    }
    
    
    func newRound() {
        if !listOfWords.isEmpty {
            let index = Int.random(in: 0 ..< listOfWords.count)
            let newWord = listOfWords.remove(at: index)
            
            currentGame = Game(word: newWord, incorrectMovesRemaining: incorrectMovesAllowed, guessedLetters: [])
            enableButtons(in: view, enable: true)
        } else {
            enableButtons(in: view, enable: false)
            
            let alert = UIAlertController(title: "Игра окончена", message: "Счет: \(totalWins) : \(totalLosses)", preferredStyle: .alert)
            
            alert.addAction(UIAlertAction(title: "OK", style: .default, handler: nil))
            
            present(alert, animated: true, completion: nil)
            
        }
        updateUI()
    }
    func show(word: String) {
        var letters = [String]()
        for letter in word {
            letters.append(String(letter))
        }
        let wordWithSpacing = letters.joined(separator: " ")
        correctWordLabel.text = wordWithSpacing
    }
        
    func updateUI() {
        treeImageView.image = UIImage(named: "Tree \(currentGame.incorrectMovesRemaining)")
        show(word: currentGame.formatedWord)
        scoreLabel.text = "Выигрыши: \(totalWins), проигрыши: \(totalLosses)"
    }

    func updateGameState() {
        if currentGame.incorrectMovesRemaining == 0 {
            totalLosses += 1
        } else if currentGame.word == currentGame.formatedWord {
            totalWins += 1
        } else {
            updateUI()
        }
    }
    
    @IBAction func buttonTapped(_ sender: UIButton) {
        sender.isEnabled = false
        
        let letterString = sender.title(for: .normal)!
        let letter = letterString.lowercased()
        currentGame.playerGuess(letter: letter)
        
        updateGameState()
    }
}




























































